import numpy as np
import scipy.stats as stats
from scipy.optimize import bisect
from scipy.stats import f

# Данные из второйгруппы (2-й прибор)
group2= [236.2, 114.8, 136.2, 187.6, 258.6, 179.4, 137.2, 128.1, 214.8, 178.1,
          129.4, 179.2, 120.6, 168.2, 200, 106.8, 197.4, 152.1, 129.8, 181.4,
          166.7, 223.2, 194.1, 178.9, 167, 181.3, 175.9, 184.4, 204.5, 182,
          172.5, 255.1, 226.3, 194.1, 177.1, 172.2, 201.1, 217.6, 168, 171.7,
          140, 204.4, 210.7, 188.6, 190.4, 193.1, 119.6, 195.5, 148.4, 205.6,
          196.8, 136.9, 141.6, 94.3, 157.9, 176.6, 144.3, 209.5, 223.4,
          190.3, 157.4, 171.6, 105.6, 140, 189.4, 197.6, 174.7, 221.7,
          200.6, 191.8]

# Данные из первой группы (1-й прибор)
group1= [160,137.3	,167.6	,174.3	,177.1	,150.1	,185,	170,	186.4	,172.2	,175.1	,155,	162.1	,171,	169,	172.1	,162,	135.8	,139.8	,138	,185.3	,165.2,	155,	144.8,	196.6	,156.6	,189.2	,168	,150.9	,157.6	,166.4	,168.4	,188.5	,187.4	,167.4	,108.6	,166.3	,195.8	,179,	184.8,	157.7	,172.1	,188.4	,186.7	,216.6	,169.7	,169.2	,161	,152.1	,150.8	,126.1	,141.8	,155	,149.4	,164.4,	121.9	,160.4	,123	,178.5
          ]

# Вычисление несмещённых оценок дисперсий
var_group1 = np.var(group1,ddof=1)
var_group2 = np.var(group2,ddof=1)
print(f"Среднее 1 группы={np.mean(group1)}, 2-й группы= {np.mean(group2)}")
print(f" Несмещённая оценка дисперсии 1 группы={var_group1 }, 2-й группы= {var_group2}")
# Вычисление статистики Фишера
F_statistic = var_group1 / var_group2

# Определение степеней свободы
dfn = len(group1) - 1
dfd = len(group2) - 1

# Определение критической области
alpha = 0.1

# Функция для вычисления P{F > c} - (1 - F(c))
def func(c):
    return f.sf(c, dfn=len(group1)-1, dfd=len(group2)-1) - alpha

# Нахождение критической константы C_alpha с помощью метода бисекции
critical_value = bisect(func, 0, 10)

# Вывод результатов
print(f"Статистика Фишера: {F_statistic}")
print(f"Критическое значение: {critical_value}")
# Вычисление критического уровня значимости (p-value)
p_value = 1 - f.cdf(critical_value, dfn=len(group1)-1, dfd=len(group2)-1)
print(f"Критический уровень значимости (p-value): {p_value}")
